Repository: ieeeistsb/website2019
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Portuguese
pt: Português

source: English
pt: Inglês

source: IEEE-IST Student Branch Administration
pt: Administração IEEE-IST Student Branch

source: What is IEEE?
pt: O que é o IEEE?

source: IEEE is the world’s largest professional association dedicated to advancing <b>technological innovation</b> and excellence for the benefit of humanity.
pt: IEEE é a maior associação profissional do mundo dedicada ao avanço da inovação tecnológica para o bem da humanidade.

source: Where are we?
pt: Onde estamos?

source: We are divided into <b>10 regions worldwide</b>. Each region divided into <b>sections</b>. Each section has chapters, affinity groups and student branches.
pt: Estamos divididos em <b>10 regiões a nível mundial</b>. Cada região está dividida em secções e cada secção tem <i>chapters</i>, <i>affinity groups</i> e <i>student branches</i>.

source: We are a student branch from <b>Portugal Section</b>.
pt: Somos um student branch da <b>secção portuguesa</b>.

source: Why join IEEE?
pt: Porquê ser membro?

source: Vast number of opportunities to enrich your knowledge.
pt: Oportunidades para enriqueceres o teu conhecimento.

source: IEEE hosts a worldwide network of professionals and experts that can help shape your career.
pt: O IEEE é composto por uma rede mundial de profissionais e especialistas que podem ajudar a lançar-te na tua carreira.

source: Access to digital libraries.
pt: Acesso a bibliotecas digitais.

source: IEEEXplore contains the world's highest quality technical literature in engineering.
pt: O IEEEXplore contém a literatura técnica com a melhor qualidade do mundo.

source: Access to international competitions.
pt: Acesso a competições internacionais.

source: Such as IEEEXtreme 24-hour programming competition and IEEE madC.
pt: Como a competição de 24 horas IEEEXtreme e o IEEE madC.

source: Develop your soft-skills
pt: Desenvolve as tuas soft-skills.

source: Organizing events and interacting with others will enhance your communication skills.
pt: Através da organização de eventos e a interação com outras pessoas irás desenvolver as tuas capacidades de comunicação.

source: Opportunity to work in teams.
pt: Oportunidade de desenvolver trabalho em equipa.

source: Our activities are organized and planned in teams.
pt: As nossas actividades são planeadas e organizadas em equipas.

source: Awards
pt: Prémios

source: IEEE-IST Student Branch Award
pt: Prémio IEEE-IST Student Branch

source: News and Activities
pt: Notícias e Actividades

source: Searching for
pt: Procura:

source: Search by tag/content
pt: Procura por tag/conteúdo

source: More sites
pt: Mais sites

source: About us
pt: Sobre nós

source: Board
pt: Direcção

source: Previous boards
pt: Direcções anteriores

source: Contacts
pt: Contactos

source: Projects & Activities
pt: Projectos & Actividades

source: Meet our awesome board!
pt: Conhece a nossa equipa!

source: We are passioned by engineering and highly motivated to work together.
pt: Somos apaixonados pela engenharia e estamos motivados para trabalhar juntos.

source: Initiatives
pt: Iniciativas

source: Subscribe to our newsletter
pt: Subscreve à nossa newsletter

source: here
pt: aqui

source: Photos
pt: Fotografias

source: Check out our photo gallery.
pt: Visita a nossa galeria de fotografias.

source: Reach us!
pt: Contacta-nos!

source: We are here to answer any questions that you may have. Send us a message using the contacts below!
pt: Estamos cá para responder a qualquer questão que tenhas. Envia-nos uma mensagem através dos seguintes contactos!

source: Follow us!
pt: Segue-nos!

source: Find us!
pt: Vem ter connosco!

source: Room 1.5 Instituto Superior Técnico – Taguspark Campus
pt: Sala 1.5 Instituto Superior Técnico – Campus Taguspark

source: Walk...
pt: Caminha...

source: ...into the steps of the future
pt: ... na direcção do futuro

source: About IEEE-IST
pt: Sobre IEEE-IST

source: We are an official student branch of IEEE, the biggest professional organization in the world for engineering.
pt: Somos um student branch oficial do IEEE, a maior organização de engenharia do mundo.

source: Support engineering and help knowledge renewal
pt: Suportar a engenharia e renovar de conhecimento

source: Implement ideas
pt: Implementar ideias

source: Cooperation and healthy environment
pt: Cooperação e ambiente agradável

source: Get to know the chapters we have at IEEE-IST Student Branch.
pt: Fica a conhecer os chapters que nós temos no IEEE-IST Student Branch.

source: Want to join our team?
pt: Queres juntar-te à nossa equipa?

source: Join us!
pt: Junta-te a nós!

source: Upcoming Events
pt: Próximos Eventos

source: Latest News
pt: Últimas Notícias

source: View all news
pt: Ver todas

source: Latest News and Activities of
pt: Últimas Notícias e Actividades de

source: Find More
pt: Lê Mais

source: Lets take a look at our foundations!
pt: Vamos olhar para as nossas origens!

source: Please upload a PDF file
pt: Por favor faça o upload de um ficheiro PDF
